Improve docs, add DownloadController
